app/controllers/owners_controller.rb

  def index
    # finding all the active owners and paginating that list (will_paginate)
  # check is the user is logged in
    @active_owners = Owner.active.alphabetical.paginate(page: params[:page]).per_page(15)
---
SELECT "owners".* FROM "owners" WHERE "owners"."active" = ? ORDER BY last_name, first_name LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "owners" WHERE "owners"."active" = ?  [["active", 1]]

  def show
    # check is the user is logged in
    authorize! :show, @owner
    # get all the pets for this
    @current_pets = @owner.pets.alphabetical.active.to_a
---
SELECT "pets".* FROM "pets" WHERE "pets"."owner_id" = ? AND "pets"."active" = ? ORDER BY name  [["owner_id", 3], ["active", 1]]

    def set_owner
      @owner = Owner.find(params[:id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]