app/controllers/pets_controller.rb

  def index
    # get data on all pets and paginate the output to 10 per page
    if current_user.owner? #equivalent to current_user.role=="owner"
      # we make sure that the owner sees only his pets
      @active_pets = current_user.owner.pets.active.alphabetical.paginate(page: params[:page]).per_page(10)
---
SELECT "pets".* FROM "pets" WHERE "pets"."active" != ? ORDER BY name LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "pets" WHERE "pets"."active" != ?  [["active", 1]]

  def set_pet
    @pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]