app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
---
  def index
    # finding all the active owners and paginating that list (will_paginate)
    @users = User.all.paginate(page: params[:page]).per_page(15)

INSERT INTO "users" ("first_name", "last_name", "role", "username", "password_digest", "active") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Eric"], ["last_name", "Gruberman"], ["role", 3], ["username", "eric"], ["password_digest", "$2a$04$.XMhkdpdmdzd3v6mbgKWbuHEEvi2JqipBKP2/GNTucqNbHJ5gBW4W"], ["active", 1]]
---
  def create
    @user = User.new(user_params)
    @user.assistant! if current_user.assistant?
    # equivalent to
    # @user.role="assistant" if current_user.role?(:assistant)
    if @user.save

UPDATE "users" SET "first_name" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["first_name", "Eric"], ["password_digest", "$2a$04$TlJIJObBZQLkAbpkNUSw1eZSK3L7rXXGau6ruFANrGFZyR7tgPrf2"], ["id", 2]]
---
  def update
    if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    if @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])