app/controllers/visits_controller.rb

  def index
    # get all visits in reverse chronological order, 10 per page
    if current_user.owner?
      @visits = current_user.owner.visits.chronological.paginate(page: params[:page]).per_page(10)
---
SELECT "visits".* FROM "visits" ORDER BY date DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]